{
    "Life": [
        {"chinese": "1. 事实胜于雄辩。", "english": "Facts beat eloquence.", "origin": "From Lu Xun's \"Hot Wind\" (鲁迅《热风题记》), it's like, \"Actions speak louder than words.\""},
        {"chinese": "2. 一言既出，驷马难追。", "english": "A team of horses will struggle to chase down a spoken word.", "origin": "From \"The Analects of Yan Yuan\" (《论语·颜渊》), it means a word spoken can never be taken back, or a promise must be kept."},
        {"chinese": "3. 路遥知马力，日久见人心。", "english": "As distance tests a horse's strength, time reveals a person's character.", "origin": "From the anonymous work \"Fight Gratitude\" (《争报恩》) of the Yuan Dynasty (1279–1368), when Mongol horsemen ruled China, this saying tells us that a long period of testing is needed to understand someone's nature and capabilities."},
        {"chinese": "4. 无规矩不成方圆。", "english": "Without standards, no boundaries are set.", "origin": "From the works of Mencius and his students (《孟子·离娄上》), it means: nothing can be accomplished without norms or standards; or: without rules, we're nothing but savages."},
        {"chinese": "5. 惩前毖后。", "english": "Punishing those who come before stops those who come after from doing something.", "origin": "From \"Sacrificial Odes of Zhou\" (《周颂》) in the Confucian classic \"Book of Songs\" (《诗经》), it means: to criticize former mistakes firmly to prevent them happening again; or: learn from past mistakes to avoid future ones."},
        {"chinese": "6. 三思而后行", "english": "Think thrice before you act.", "origin": "From \"The Analects\" (《论语》), it's like: \"Look before you leap.\""},
        {"chinese": "7. 良药苦口。", "english": "Good medicine tastes bitter.", "origin": "It means: frank criticism is hard to swallow."},
        {"chinese": "8. 有理走遍天下，无理寸步难行。", "english": "With truth on your side, you can go anywhere; without truth, you can't take a tiny step.", "origin": "From the philosophical work \"White Horse Thesis\" (白马论) by Gong Sunlong (公孙龙), this stresses the fact that righteousness will see you through all difficulties, whereas without it your progress will be hampered from the very start."},
        {"chinese": "9. 当局者迷，旁观者清。", "english": "The player is lost; the watcher is lucid.", "origin": "From the \"Biography of Yuan Xingchong\" in the Old Book of Tang (《旧唐书·元行冲传》), this points out that a person involved in a matter usually does not have a comprehensive overview of it, due to too much concentration on the details, while the onlookers, who have a calmer and more objective attitude, have a better grasp of what is going on."},
        {"chinese": "10. 十年树木，百年树人。", "english": "Ten years to cultivate wood, a hundred years to cultivate a man.", "origin": "From the work of Guan Zhong (《管子·权修 第三》) who was a politician in the Spring and Autumn Period, it means that (though 10 years to grow a tree that's ready to be used as wood is a long time,) a person's education is a life-long process or most time-consuming."},
        {"chinese": "11. 民以食为天。", "english": "Food is the first priority of the people.", "origin": "From \"Records of the Grand Historian\" (《史记》), it means 'hunger breeds discontent', and its full form is \"王者以民人为天，而民人以食为天。\" — 'Kings treat the people as heaven, moreover, people treat food as heaven.' … meaning a ruler's first priority is his subjects; the subjects' first priority is food."},
        {"chinese": "12. 善有善报。", "english": "Repay good with good.", "origin": "From the Southern Dynasties work \"New Wine and Meat\" (《新酒肉文》) by Emperor Wu of Liang (464–549), it means: virtue has its rewards; or: one good turn deserves another."},
        {"chinese": "13. 顾左右而言他。", "english": "Deliberately vague and deflective.", "origin": "From \"King Hui of Liang\" in the Book of Mencius (《孟子·梁惠王下》), it means to be vague and elusive under questioning."},
        {"chinese": "14. 几家欢喜几家愁。", "english": "While some are happy, some are anxious.", "origin": "It means: one man's disaster is another man's delight."},
        {"chinese": "15. 人过留名，雁过留声。", "english": "A person leaves a reputation, as a swallow leaves its call.", "origin": "From the 32nd chapter of Legend of Heroes (《儿女英雄传》), it means that someone's reputation is easily remembered."},
        {"chinese": "16. 万事俱备，只欠东风。", "english": "Everything's ready except the east wind.", "origin": "From the \"Romance of the Three Kingdoms\" (《三国演义》), this means that everything is ready except what is crucial."},
        {"chinese": "17. 麻雀虽小，五脏俱全。", "english": "Small as it is, the sparrow has all the vital organs.", "origin": "From Qian Zhongshu's work \"Fortress Besieged\" (《围城》), it means that although something looks small, its content is very comprehensive."},
        {"chinese": "18. 桂林山水甲天下。", "english": "Guilin's scenery's best on earth.", "origin": "It was written by the Song Dynasty governor of Guilin, Wang Zhenggong (王正功,1133–1203) as part of a poem in 1201, and has been so often quoted in Chinese culture that Guilin has become the image of scenic beauty in China."},
        {"chinese": "19. 哑巴吃饺子，心里有数。", "english": "When a mute eats dumplings, he knows how many he has eaten.", "origin": "This is used to point out that someone knows the situation quite well, yet says nothing… as is common in Chinese culture. Chinese tend to keep their thoughts to themselves… see more on Chinese and Western Thought >>>"},
        {"chinese": "20. 人逢喜事精神爽。", "english": "A happy occasion gladdens the spirit.", "origin": "From \"Journey to the West\" (《西游记》), it means that everyone likes a happy occasion."},
        {"chinese": "21.一举两得。", "english": "Two benefits from one action.", "origin": "Variously attributed to \"History of the Later Han Dynasty\" (c. 200), \"The Book of Jin\" (420), \"Stories to Caution the World\" (1624, Feng Menglong), and Lu Xun's collected letters, this is the Chinese version of \"to kill two birds with one stone\" (一石二鸟。Yīshíèrniǎo/ 'one stone two birds'), possibly of Ovid."},
        {"chinese": "22. 如坐针毡。", "english": "Like sitting on a carpet of needles.", "origin": "It means to feel tense and uneasy."},
        {"chinese": "23. 逆来顺受。", "english": "When adversity comes, receive it favorably.", "origin": "It means to take things as they come."},
        {"chinese": "24. 化干戈为玉帛。", "english": "Replace weapons with jade and silk.", "origin": "From the first chapter of the \"Huainanzi\" (《淮南子·原道训》), i.e. to \"bury the hatchet\" and work for peace."},
        {"chinese": "25. 此地无银三百两。", "english": "This ground doesn't have 300 taels of silver.", "origin": "It comes from a folk story about a man who buried a lot of silver and, because people suspected that's what he had done, put up a sign saying, \"300 taels of silver are not in this ground.\" His neighbor King Two then stole the silver and put up a sign saying: \"Your neighbor King Two did not steal it.\" It means to reveal what one intends to hide, i.e. don't try to prove what people suspect, or you'll make your guilt still more obvious."},
        {"chinese": "26. 兵不厌诈。", "english": "Soldiers don't hate deceit.", "origin": "From an ancient Chinese political philosopher Master Han Fei's work \"Han Feizi\" (《韩非子》), it means: nothing is too deceitful in war, or: there can never be too much deception in war, or: all's fair in war"},
        {"chinese": "27. 木已成舟，生米煮成熟饭。", "english": "The timber's already a boat; the rice is cooked.", "origin": "It means: what's done cannot be undone."},
        {"chinese": "28. 身体力行。", "english": "A body acts according to physical strength.", "origin": "From the \"Huainanzi\" (《淮南子·原道训》), it means to practice what you preach."},
        {"chinese": "29. 大智若愚。", "english": "Great wisdom can seem foolish.", "origin": "From \"Laozi\" (《老子》), it means: great intelligence may appear to be stupidity, and is sometimes used to describe a situation where \"he knows most who speaks least\"."},
        {"chinese": "30. 捷足先登。", "english": "The quick-footed climb first.", "origin": "From the Historical Records (《史记》), i.e. \"first come, first served\", or \"the early bird gets the worm\", this is the old version of \"先到先得\" (Encouragement #14 above). Love is an eternal theme for sayings, and it's no different in China. Here are some Chinese idioms about love and romance. These old sayings usually espouse love or commitment to love."}
    ],
    "Love": [
        {"chinese": "1. 一见钟情。", "english": "Love at first sight.", "origin": "It's generally used for people, but you can also use it for other physical things/activities..."},
        {"chinese": "2. 愿得一人心，白首不相离。", "english": "Long for a heart, never be apart.", "origin": null},
        {"chinese": "3. 执子之手，与子偕老。", "english": "Hold hands with you, grow old with you.", "origin": "Like 2., this expresses lifelong commitment in love."},
        {"chinese": "4. 爱不是占有，而是欣赏。", "english": "Love isn't about having, it's about enjoying (what you have).", "origin": null},
        {"chinese": "5. 爱屋及乌。", "english": "Love the house and its crow.", "origin": "It means that love encompasses everything connected with somebody: \"Love me, love my dog.\""},
        {"chinese": "6. 萝卜青菜，各有所爱。", "english": "Radishes and greens, each has those who love them.", "origin": "I.e. \"one man's meat is another man's poison\" or \"each to his own\"."},
        {"chinese": "7. 在天愿作比翼鸟，在地愿为连理枝。", "english": "Birds flying in the sky as one; branches growing on the earth as one.", "origin": "This is a wish for conjugal bliss."},
        {"chinese": "8. 有情人终成眷属。", "english": "People in love become spouses in the end.", "origin": "I.e. love will find a way."},
        {"chinese": "9. 情人眼里出西施。", "english": "In a lover's eye is the foremost Beauty.", "origin": "\"Beauty is in the eye of the beholder.\""},
        {"chinese": "10. 有情饮水饱，无情食饭饥。", "english": "With love water is enough; without love, food doesn't satisfy.", "origin": "It's similar to Proverbs 15:17 — \"Better is a dinner of herbs where love is, than a stalled ox and hatred therewith.\" setTimeout(function() { var videoPlayer = document.getElementById('videoPlayer'); var videoUrl = videoPlayer.getAttribute(\"data-src\"); videoPlayer.setAttribute('src', videoUrl); videoPlayer.removeAttribute('data-src'); }, 6000); Watch more videos about Chinese culture stories. Positive phrases that make us visualize success are the foundation of morale. In Chinese, there are many old sayings to encourage others to continue (to work hard) despite (or because of) the trials of life."}
    ],
    "Success": [    
        {"chinese": "1. 冰冻三尺，非一日之寒。", "english": "It takes more than one cold day for a river to freeze a meter deep.", "origin": "This means: \"Rome wasn't built in a day.\" I.e. If you keep working you'll achieve your goal."},
        {"chinese": "2. 机不可失，时不再来。", "english": "Don't miss opportunities: time doesn't come round again.", "origin": "Opportunity knocks but once."},
        {"chinese": "3. 人心齐，泰山移。", "english": "When people work with one heart, they can even move Mount. Tai.", "origin": null},
        {"chinese": "4. 万事开头难。", "english": "All things are difficult at the start.", "origin": "I.e. Things always get easier if you persevere."},
        {"chinese": "5. 失败是成功之母。", "english": "Failure is the mother of success.", "origin": null},
        {"chinese": "6. 只要功夫深，铁杵磨成针。", "english": "It just needs hard work to grind an iron rod into a needle.", "origin": "This proverb encourages us to persevere to succeed."},
        {"chinese": "7. 水滴石穿，绳锯木断。", "english": "Water drops pierce stone; rope saws cut wood.", "origin": "Patience and persistence can break through anything, no matter how great the difficulty. Similar to Ovid's \"Dripping water hollows out stone, not through force but through persistence.\""},
        {"chinese": "8. 一日之计在于晨。", "english": "A day's planning is done at dawn.", "origin": "I.e. make your plans early, or get up early, as this will affect the whole day/undertaking."},
        {"chinese": "9. 千里之行，始于足下。", "english": "A thousand-li journey starts with a footfall.", "origin": null},
        {"chinese": "10. 否极泰来。", "english": "Peace replaces extreme evil.", "origin": "I.e. all nightmares end."},
        {"chinese": "11. 青出于蓝而胜于蓝。", "english": "Green is from blue, and better than blue.", "origin": "This is used to describe when a disciple has surpassed his master."},
        {"chinese": "12. 老骥伏枥，志在千里。", "english": "An old warhorse in the stable still longs to gallop a thousand li.", "origin": "This describes one who still cherishes high aspirations in spite of age. Or: \"You're never too old to live your dream.\""},
        {"chinese": "13. 吃得苦中苦，方为人上人。", "english": "Enduring deepening pain is how man ascends.", "origin": "I.e. \"No pain, no gain.\""},
        {"chinese": "14. 先到先得。", "english": "The first to arrive is the first to succeed.", "origin": "I.e. \"the early bird catches the worm.\""},
        {"chinese": "15. 守得云开见月明。", "english": "Watch till clouds part to see the moonlight.", "origin": "I.e. \"Every cloud has a silver lining\" or trouble will pass."},
        {"chinese": "16. 逆境出人才。", "english": "Adversity yields flair.", "origin": null},
        {"chinese": "17. 吃一堑，长一智。", "english": "Suffer a moat, grow in wisdom.", "origin": "Having gone through a setback, one will have gained experience and wisdom, which will be useful if only one can take warning and learn something from the setback. \"A fall in a pit, a gain in your wit.\""},
        {"chinese": "18. 不能一口吃成胖子。", "english": "You can't get fat with one mouthful.", "origin": "I.e. Some things aren't accomplished in a moment. Don't give up!"},
        {"chinese": "19. 风无常顺，兵无常胜。", "english": "Wind isn't always favorable; soldiers aren't always victorious.", "origin": "This proverb urges us to be fully prepared for difficulties and setbacks: it is impossible to have smooth sailing all the time."},
        {"chinese": "20. 星星之火，可以燎原。", "english": "Starlight shines far.", "origin": "Translated as: \"A single spark can start a prairie fire.\" Seemingly small actions have far-reaching consequences."},
        {"chinese": "21. 哀兵必胜。", "english": "An aggrieved army is sure to win.", "origin": "It means an army burning with righteous indignation is bound to win. Welcome to join our Facebook group of Chinese Station. Enjoy free daily updates for Chinese learning. Chinese people have traditionally been good at drawing lessons from the ordinary things of life. Below are some of the most common wisdom sayings that give practical life advice. The most time-honored and popular Chinese sayings present wisdom or a concept in a short pithy idiom. Many have just four Chinese characters."}
    ],
    "Wisdom" : [    
        {"chinese": "1. 不作不死。", "english": "If you don't do stupid things you won't end up in tragedy.", "origin": "This Chinese web saying is recorded in the Urban Dictionary. It's like: \"Don't poke the bear.\""},
        {"chinese": "2. 塞翁失马，焉知非福。", "english": "Blessings come in disguise.", "origin": "According to the book \"Huainanzi — Lessons of the Human World\", an old man living in a border region lost his horse and people came to comfort him. But he said, \"This may be a blessing in disguise, who knows?\" Indeed, the horse later returned to the man and brought him a better horse."},
        {"chinese": "3. 小洞不补，大洞吃苦。", "english": "If small holes aren't fixed, then big holes will bring hardship.", "origin": "This proverb tells us that if a trivial problem is not solved in time, it will become a serious and knotty one. Similar to: \"A stitch in time saves nine.\""},
        {"chinese": "4. 水满则溢。", "english": "Water flows in only to flow out.", "origin": "Similar to \"what comes up must come down\", this proverb points out that: things reverse when they reach their extremes. It's from the 18th-century novel \"A Dream of Red Mansions\"."},
        {"chinese": "5. 读万卷书不如行万里路。", "english": "It's better to walk thousands of miles than to read thousands of books.", "origin": "I.e/ 'doing beats reading' or 'experience beats theory '."},
        {"chinese": "6. 三个和尚没水喝。", "english": "Too many cooks spoil the broth.", "origin": "I.e. if too many people try to do something, like three monks trying to carry one bucket of water, they make a mess of it."},
        {"chinese": "7. 一笑解千愁。", "english": "A smile dispels many worries.", "origin": null},
        {"chinese": "8. 笑一笑,十年少。", "english": "Happiness is the best cosmetic.", "origin": null},
        {"chinese": "9. 美名胜过美貌。", "english": "A good name is better than a good face.", "origin": null},
        {"chinese": "10. 不善始者不善终。", "english": "A bad beginning makes a bad ending.", "origin": null},
        {"chinese": "11. 大处着眼，小处着手。", "english": "Keep the general goal in sight while tackling daily tasks.", "origin": "This proverb advises us to always keep the overall situation in mind, and be far-sighted, while we set our hands to mundane business."},
        {"chinese": "12. 一步一个脚印。", "english": "Every step makes a footprint.", "origin": "Work steadily and make solid progress."},
        {"chinese": "13. 一个萝卜一个坑儿。", "english": "Each has his own task, and nobody is dispensable.", "origin": "I.e. \"each to his own\", \"horses for courses\", or \"every kettle has its lid\"."},
        {"chinese": "14. 留得青山在，不怕没柴烧。", "english": "While there are green hills, there'll be wood to burn.", "origin": "I.e. \"Where there is life, there is hope.\""},
        {"chinese": "15. 一鸟在手胜过双鸟在林。", "english": "A bird in the hand is worth two in the bush.", "origin": null},
        {"chinese": "16. 人无完人，金无足赤。", "english": "No man is a perfect man; no gold is sufficiently bare.", "origin": "It is as impossible to find a perfect man as it is to find 100 percent pure gold. I.e. \"no-one's perfect\"."},
        {"chinese": "17. 千军易得, 一将难求。", "english": "It is easy to find a thousand soldiers, but hard to find a good general.", "origin": "This proverb notes the difficulty of finding an outstanding leader."},
        {"chinese": "18. 宰相肚里好撑船。", "english": "A prime minister's mind should be broad enough for polling a boat.", "origin": "This can be used to praise someone a magnanimous person. The saying is from the novel \"Officialdom Unmasked\" (官场现形记) by Li Baojia (李宝嘉1867–1906)"},
        {"chinese": "19. 难得糊涂。", "english": "Ignorance is bliss.", "origin": "Or: \"Where ignorance is bliss, it's folly to be wise.\""},
        {"chinese": "20. 祸从口出。", "english": "Disaster comes from the careless talk.", "origin": null},
        {"chinese": "21. 三人一条心，黄土变成金。", "english": "If people are of one heart, even loess can become gold.", "origin": "This proverb tells us that as long as people are unified, any goal can be achieved."},
        {"chinese": "22. 身正不怕影子斜。", "english": "One who stands straight doesn't fear a crooked shadow.", "origin": "Similar to: \"A straight foot is not afraid of a crooked shoe.\" I.e. A righteous man is not afraid to seem unrighteous."},
        {"chinese": "23. 有借有还，再借不难。", "english": "Timely return of a loan makes it easier to borrow a second time.", "origin": null},
        {"chinese": "24. 蜡烛照亮别人，却毁灭了自己。", "english": "A candle lights others and consumes itself.", "origin": "This refers to self-sacrifice for the benefit of others."},
        {"chinese": "25. 种瓜得瓜, 种豆得豆。", "english": "You reap what you sow.", "origin": "This proverb warns that one receives just returns for one's actions; good for good and evil for evil. It's similar to the Biblical: \"…whatsoever a man soweth, that shall he also reap.\""},
        {"chinese": "26.欲速则不达。", "english": "Those who just want speed don't succeed.", "origin": "This saying from \"The Analects of Confucius\" teaches that patience and the right method achieve the right result, where trying to do the same thing too quickly (by cutting corners) does not. It's similar to: \"More haste, less speed.\" Rare as true love is, true friendship is rarer. Chinese people have always thought very highly of friendship, so there are many old sayings about it."}
    ],
    "Friendship" : [    
        {"chinese": "1. 近水知鱼性, 近山识鸟音。", "english": "To know a fish go to the water; to know a bird's song go to the mountains.", "origin": "This verse from 'Expanding Virtue Literature' (增广贤文) teaches that to know someone you should go to his or her home."},
        {"chinese": "2. 听君一席话，胜读十年书。", "english": "Listening to a lord's remarks is better than reading books for ten years.", "origin": null},
        {"chinese": "3. 凡人不可貌相, 海水不可斗量。", "english": "In short: \"don't judge by appearances\".", "origin": null},
        {"chinese": "4. 有缘千里来相会。", "english": "Fate brings people together from far apart.", "origin": "This proverb espouses that human relationships are decreed by fate."},
        {"chinese": "5. 君子之交淡如水。", "english": "A gentleman's friendship is insipid as water.", "origin": null},
        {"chinese": "6. 入乡随俗。", "english": "When entering a locality follow the local customs.", "origin": "Like: \"When in Rome, do as the Romans do.\""},
        {"chinese": "7. 患难见真情。", "english": "In hardship, we see true friendship.", "origin": "Similar to: \"A friend in need is a friend indeed.\""},
        {"chinese": "8. 知音难觅。", "english": "An intimate friend is hard to find.", "origin": null},
        {"chinese": "9. 广交友，无深交。", "english": "Numerous friends means no deep friendship.", "origin": "Similar to: \"A friend to everybody is a friend to nobody.\""},
        {"chinese": "10. 道不同，不相为谋。", "english": "Men of different principles don't work well together.", "origin": null}
    ],
    "Family" : [    
        {"chinese": "1. 月到中秋分外明，每逢佳节倍思亲。", "english": "The harvest moon is brightest; every festival's homesickness multiplies.", "origin": "Familial longing is greatest in China on its traditional family reunion festivals, like Mid-Autumn, the harvest moon festival. More of the meaning behind this saying is revealed in Mid-Autumn Festival's Traditions."},
        {"chinese": "2. 儿行千里母担忧。", "english": "When children travel far, mothers worry.", "origin": null},
        {"chinese": "3. 但愿人长久，千里共婵娟。", "english": "Wishing us long life, though sharing moonlight from afar.", "origin": "This poetic verse expresses (familial) love and homesickness, and is one of many Popular Mid-Autumn Festival Sayings."},
        {"chinese": "4. 家和万事兴。", "english": "If a family is harmonious everything will go well.", "origin": "It's like the Biblical: \"if a house is divided against itself, it cannot stand.\""},
        {"chinese": "5. 家家有本难念的经。", "english": "Every family has its problems.", "origin": "Or: \"There're skeletons in every family's closet.\""},
        {"chinese": "6. 清官难断家务事。", "english": "Even an upright official finds it hard to settle a family quarrel.", "origin": null},
        {"chinese": "7. 有其父，必有其子。", "english": "Where there's a father, there's his son.", "origin": "I.e. \"Like father, like son.\""},
        {"chinese": "8. 家丑不可外扬。", "english": "Family shames must not be spread abroad.", "origin": "I.e. \"Do not wash your dirty linen in public.\""},
        {"chinese": "9. 不当家，不知柴米贵。", "english": "If you don't run the family, you don't know the value of fuel and rice.", "origin": "He who heads a family knows the responsibility involved."},
        {"chinese": "10. 金窝，银窝，不如自家的狗窝。", "english": "Gold and silver nests can't beat one's family kennel.", "origin": "I.e. \"East, west, home is best.\" The Chinese have always attached importance to study, so there are also many idioms to promote study."}
    ],
    "Learning" : [    
        {"chinese": "1. 书是随时携带的花园。", "english": "A book is a pocket garden.", "origin": null},
        {"chinese": "2. 活到老，学到老。", "english": "Live till you're old, and study till you're old.", "origin": "\"Don't stop studying\" or \"you're never too old to learn.\""},
        {"chinese": "3. 好书如挚友。", "english": "A good book is like a good friend.", "origin": null},
        {"chinese": "4. 一寸光阴一寸金，寸金难买寸光阴。", "english": "An inch of time is worth an inch of gold, but an inch of gold may not buy an inch of time.", "origin": "I.e. time is money, but it's difficult to buy time."},
        {"chinese": "5. 好记性不如烂笔头。", "english": "A good memory can't beat a bad pen.", "origin": "I.e. \"The palest ink is better than the best memory.\""},
        {"chinese": "6. 花有重开日，人无再少年。", "english": "Flowers may bloom again; you're never young again.", "origin": "I.e. don't waste your youth."},
        {"chinese": "7. 学而不思则罔，思而不学则殆。", "english": "Learning without thought is deceptive; thought without learning is perilous.", "origin": null},
        {"chinese": "8. 书到用时方恨少。", "english": "When using books, you'll regret reading few.", "origin": "This proverb reminds us that we can never read widely enough."},
        {"chinese": "9. 读书须用意，一字值千金。", "english": "Reading requires concentration; a word may be worth a fortune.", "origin": "This proverb stresses the fact that study requires undivided attention. No single word should be passed over before we fully understand it. Only in this way can study be rewarded."},
        {"chinese": "10. 严师出高徒。", "english": "Strict teachers produce fine students.", "origin": "Dragons are found in many aspects of Chinese culture, including sayings. Chinese dragons are seen as lucky and good — quite different from dragons in most Western stories."}
    ],
    "Dragon" : [    
        {"chinese": "1. 龙飞凤舞。", "english": "The dragonflies and the phoenix dances.", "origin": "It refers to a flamboyant style of calligraphy and writing devoid of content."},
        {"chinese": "2. 龙马精神。", "english": "A dragon's and a horse's spirit.", "origin": "It refers to a vigorous spirit in old age."},
        {"chinese": "3. 鱼龙混杂。", "english": "A muddled mix of fish and dragons.", "origin": "It refers to crooks mixed in with honest folk."},
        {"chinese": "4. 龙腾虎跃。", "english": "Dragons soaring and tigers leaping.", "origin": "It refers to a scene of bustling activity."},
        {"chinese": "5. 车水马龙。", "english": "Carriages like a stream and horses like a dragon.", "origin": "It refers to a scene of heavy traffic (Chinese dragons have very long bodies)."},
        {"chinese": "6. 龙潭虎穴。", "english": "A dragon's pool and a tiger's den.", "origin": "It refers to a very dangerous spot."},
        {"chinese": "7. 画龙点睛。", "english": "Paint a dragon and dot the eye.", "origin": "It refers to adding the vital finishing touch; the crucial point that brings the subject to life."},
        {"chinese": "8. 叶公好龙。", "english": "Lord Ye loves dragons.", "origin": "It refers to someone who pretends to like something that he really fears."},
        {"chinese": "9. 鲤鱼跳龙门。", "english": "A carp has jumped the dragon's gate.", "origin": "It refers to someone who has successfully passed the civil service examination."},
        {"chinese": "10. 强龙难压地头蛇。", "english": "Even a dragon struggles to control a snake in its native haunt.", "origin": "This means: powerful outsiders can hardly afford to neglect local villains."}
    ]
}